app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("firstname", "lastname", "company_number", "status", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)