app/controllers/services_controller.rb

  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("company_number", "name", "image", "value", "price", "starting_cost", "number_of_posts", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)